{
	"Name": "Donald Cruz",
	"Url":  "CruzOnAmerica.org",
	"Priority": [1, 3, 2, 4],
	"Titles" : 
			[
		"The Great Wall of Mexico",
		"Biblical Tax",
		"Lower Taxes On Employers"
			],
	"Summaries" : 
			[
		"This country is full of undocumented workers, undocumented criminals and undocumented terrorists.  In addition to increase in drugs and crime, our open borders create a serious national security risk.  Anyone can easily walk across the border from Mexico.  ",
		"Over half the citizen don’t pay any taxes, and the rich bypass paying because of loopholes. We need to eliminate the IRS and make the collection of taxes equal for all citizens.  The Bible has the concept of a tithe or 10%.",  
		"The government does not create job.  Small businesses do. When the government raises taxes or imposes regulations on business, it forces the business to cut back or raise prices.  Because of these regulations, businesses are dis-incentivized to hire full time workers."
			],
	"Proposals" : 
			[
		"I will build a fifty foot high wall to prevent random people from entering this country.  At $1000 per linear foot, the cost will be only be (1989 miles X 5280 ft/mile X $1000) ~10 billion.  It won’t cost the American Tax Payer a dime.  I will get the Mexican government to pay for it.",
		"I propose we we move to a flat 10% tax.  This will eliminate the need for the IRS and will allow the government to collect taxes at a transaction level. Such as when a employee is paid or after the sale of a stock or a property.  I also propose having a Tax Sabbatical  (also biblical) where every seventh year starting at the age of 21, every American will not be required to pay any taxes for an entire year.  The economic stimulus of 1/7th of the population working hard every year to exploit tax free exchanges will compensate for the direct loss of revenue. This will eliminate the need for the IRS and April 15th will designated as a new nation holiday. ",
		"I propose that we base our corporate tax rate, not of income but income per full-time so that companies who hire more employees will pay a lower rate that those  how employ less. I will aggressively remove regulation that hinder employment."
			]
}




 



