
{
	"Name": "Ben Fiorina",
	"Url":  "Vote4Ben.org",
	"Priority": [2, 1, 4, 3, 4],
	"Titles" : 
			[
		"Document And Enforce",
		"Logarithmic Progressive Tax LPT",
		"Personal Minimum Wage"
			],
	"Summaries" : 
			[
		"As Americans, we have the right to determine who we let into our country. Congress has made laws regarding this, however, decades of unenforcement of these regulations has allowed a significant number of people to reside here outside the law. Many of these individuals we want to keep but some of them we don't.",
		"Every year congress wastes time quibbling over new changes to the tax code to benefit or punish targeted constituencies. The purpose of taxes is to finance government and everyone to contribute. ",
		"Almost half the American workforce don’t work or contribute to the economy.  This is grossly unfair to the other half who do.   Our economy has grown an anemic average of 1% the past seven year. "
			],
	"Proposals" : 
			[
		"I will implement a digital identification system and we will give all currently undocumented residents six months to register and receive a temporary card. This card will have to be renewed annually.  After this six month period, we will vigorously enforce our immigration laws and enlist the help of all federal, state and local law enforcement to identify and catch anyone found inside our country illegally.  The information gathered by this system will provide the information that will allow Congress to create laws and regulations regarding these now documented residents.",
		"I propose that we throw away the current system and replace it with a Logarithmic Progressive Tax (LPT).  The LPT is simple and fair and guarantees that people with higher incomes will have higher tax rates and pay higher taxes.  All income will be places in a Personal Income Account (PIA) and taxes and tax rate will be calculated and paid upon withdrawal according to the following formula:" ,
		"I propose replacing all welfare entitlement with a Personal Minimum Wage.  For up to 20 hours per week, when wages are deposited in a Personal Income Account, the government will supplement the personal income of all workers to meet a $18/hr minimum. For example, a person making $8/hr would get a $10/hr supplement.  A $15/hr person would get a $3/hr.   People who want to make more money will work longer hours.  Also, to insure jobs, the government will grant wavers to schools, municipalities and non-profit organizations allowing them to hire help at half the minimum wage.  Everyone will have a job, everyone will have money and our economy will boom."

			]
}













